bossa_nova_artists/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "verified", "instrument", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Fake Bossa"], ["verified", 0], ["instrument", "bass"], ["age", 99], ["created_at", "2020-10-30 19:15:14.644018"], ["updated_at", "2020-10-30 19:15:14.644018"]]
---
    def create
        @artist = Artist.create(artist_params)

SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "artists" SET "name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "Elizeth Cardosooooo"], ["updated_at", "2020-10-30 19:15:51.654158"], ["id", 42]]
---
    def update
        @artist = Artist.find(params[:id])
        @artist.update(artist_params)

SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 31]]
---
    def destroy
        delete_artist = Artist.find(params[:id])
        delete_artist.delete

SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]
---
    def artist_songs
        @artist = Artist.find(params[:id])