bossa_nova_artists/app/models/artist.rb

INSERT INTO "songs" ("name", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Ginza Samba"], ["artist_id", 45], ["created_at", "2020-10-30 19:27:11.089529"], ["updated_at", "2020-10-30 19:27:11.089529"]]
---
    def write_songs(name)
        Song.create(name:name, artist_id: self.id)